<a href="https://colab.research.google.com/github/mupungijose-hue/Data-Analysis-Projects/blob/main/Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Pandas Series**

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
array = np.arange(5)
pd.Series(array)

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [ ]:
# Renaming our Series
pd.Series(np.arange(5), name = 'Test Array')

0    0
1    1
2    2
3    3
4    4
Name: Test Array, dtype: int64

In [ ]:
# series cannot be reshaped, they are 1 dimensional. To reshape them we use pandas data frame
series = pd.Series(array)
series.values

array([0, 1, 2, 3, 4])

In [ ]:
series.values.mean()

np.float64(2.0)

In [ ]:
series.mean()

np.float64(2.0)

In [ ]:
# manually assigning index
series.index = [10, 20, 30, 40, 50]

**Pandas Data Types**

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
pd.Series(range(5))

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [ ]:
# Conerting to different data types
pd.Series(range(5)).astype("float")

0    0.0
1    1.0
2    2.0
3    3.0
4    4.0
dtype: float64

In [ ]:
pd.Series(range(5)).astype("bool")

0    False
1     True
2     True
3     True
4     True
dtype: bool

In [ ]:
pd.Series(range(5)).astype("object")

0    0
1    1
2    2
3    3
4    4
dtype: object

In [ ]:
pd.Series(range(5)).astype("string")

0    0
1    1
2    2
3    3
4    4
dtype: string

In [ ]:
# easy to perfom operations on Int
pd.Series(range(5)).astype("bool").mean()

np.float64(0.8)

In [ ]:
pd.Series(range(5)).astype("float").sum()

np.float64(10.0)

**The Index**

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
my_series = pd.Series(range(5))
my_series

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [ ]:
my_series[2]

np.int64(2)

In [ ]:
my_series[2:4]

2    2
3    3
dtype: int64

In [ ]:
my_series[1::2]

1    1
3    3
dtype: int64

In [ ]:
my_series = pd.Series(range(5), index = ["Day 0", "Day 1", "Day 2", "Day 3", "Day 4"])
my_series

Day 0    0
Day 1    1
Day 2    2
Day 3    3
Day 4    4
dtype: int64

In [ ]:
my_series["Day 1"]

np.int64(1)

In [ ]:
my_series["Day 2":"Day 4"]

Day 2    2
Day 3    3
Day 4    4
dtype: int64

**The ILOC Method**
# to acces values on their individual positions

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
my_series = pd.Series(
    [0, 1, 2, 3, 4], index=["Day 0", "Day 1","Day 2", "Day 3", "Day 4" ]
)
my_series

Day 0    0
Day 1    1
Day 2    2
Day 3    3
Day 4    4
dtype: int64

In [ ]:
my_series.iloc[1:]

Day 1    1
Day 2    2
Day 3    3
Day 4    4
dtype: int64

In [ ]:
my_series.iloc[[1, 3, 4]]

Day 1    1
Day 3    3
Day 4    4
dtype: int64

In [ ]:
my_series.iloc[1:4]

Day 1    1
Day 2    2
Day 3    3
dtype: int64

**The LOC Method**
accesing values by their custom labels

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
my_series = pd.Series(
    [0, 1, 2, 3, 4], index=["Day 0", "Day 1","Day 2", "Day 3", "Day 4" ]
)
my_series

Day 0    0
Day 1    1
Day 2    2
Day 3    3
Day 4    4
dtype: int64

In [ ]:
my_series.loc["Day 1": "Day 3"]

Day 1    1
Day 2    2
Day 3    3
dtype: int64

In [ ]:
my_series.index = [0, 2, 3, 100, 5]
my_series

0      0
2      1
3      2
100    3
5      4
dtype: int64

In [ ]:
my_series.loc[0:5]

0      0
2      1
3      2
100    3
5      4
dtype: int64

In [ ]:
my_series.reset_index(drop = True)

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [ ]:
my_series.reset_index(drop = False)

   index  0
0      0  0
1      2  1
2      3  2
3    100  3
4      5  4

In [ ]:
my_series.reset_index(drop = True).loc[:3]

0    0
1    1
2    2
3    3
dtype: int64

**DUplicate Index Values**

In [ ]:
my_series = pd.Series(
    [0, 1, 2, 3, 4], index=['Day 0', 'Day 0','Day 0', 'Day 1', 'Day 2']
)
my_series.index

Index(['Day 0', 'Day 0', 'Day 0', 'Day 1', 'Day 2'], dtype='object')

In [ ]:
my_series["Day 1"]

np.int64(3)

In [ ]:
my_series["Day 0"]

Day 0    0
Day 0    1
Day 0    2
dtype: int64

In [ ]:
my_series.reset_index()

   index  0
0  Day 0  0
1  Day 0  1
2  Day 0  2
3  Day 1  3
4  Day 2  4

**Filtering Series**

In [ ]:
my_series = pd.Series(
    [0, 1, 2, 3, 4], index=["Day 0", "Day 1","Day 2", "Day 3", "Day 4"]
)
my_series

Day 0    0
Day 1    1
Day 2    2
Day 3    3
Day 4    4
dtype: int64

In [ ]:
my_series != 2

Day 0     True
Day 1     True
Day 2    False
Day 3     True
Day 4     True
dtype: bool

In [ ]:
my_series.loc[my_series != 2]

Day 0    0
Day 1    1
Day 3    3
Day 4    4
dtype: int64

In [ ]:
my_series.loc[my_series.isin([1,2])]

Day 1    1
Day 2    2
dtype: int64

In [ ]:
my_series.loc[~my_series.isin([1,2])]

Day 0    0
Day 3    3
Day 4    4
dtype: int64

In [ ]:
my_series.loc[my_series > 2]

Day 3    3
Day 4    4
dtype: int64

**Sorting Series**

we can sort by value or index

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
my_series = pd.Series(
    [0, 1, 2, 3, 4], index=["Day 1", "Day 0","Day 2", "Day 3", "Day 4"]
)
my_series

Day 1    0
Day 0    1
Day 2    2
Day 3    3
Day 4    4
dtype: int64

In [ ]:
my_series.sort_values(ascending=False)

Day 4    4
Day 3    3
Day 2    2
Day 0    1
Day 1    0
dtype: int64

In [ ]:
my_series.sort_index()

Day 0    1
Day 1    0
Day 2    2
Day 3    3
Day 4    4
dtype: int64

In [ ]:
my_series.sort_index(ascending = False)

Day 4    4
Day 3    3
Day 2    2
Day 1    0
Day 0    1
dtype: int64

**Arithmetic Operators & Methods**

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
my_series = pd.Series(
    [1, np.nan, 2, 3, 4], index=["Day 1", "Day 0","Day 2", "Day 3", "Day 4"]
)
my_series

Day 1    1.0
Day 0    NaN
Day 2    2.0
Day 3    3.0
Day 4    4.0
dtype: float64

In [ ]:
my_series + 1

Day 1    2.0
Day 0    NaN
Day 2    3.0
Day 3    4.0
Day 4    5.0
dtype: float64

In [ ]:
my_serise2 = my_series.add(1, fill_value = 0).astype('int')
my_serise2

Day 1    2
Day 0    1
Day 2    3
Day 3    4
Day 4    5
dtype: int64

In [ ]:
my_serise2 /2

Day 1    1.0
Day 0    0.5
Day 2    1.5
Day 3    2.0
Day 4    2.5
dtype: float64

In [ ]:
my_series + my_serise2

Day 1    3.0
Day 0    NaN
Day 2    5.0
Day 3    7.0
Day 4    9.0
dtype: float64

In [ ]:
my_series.add(my_serise2, fill_value = 1)

Day 1    3.0
Day 0    2.0
Day 2    5.0
Day 3    7.0
Day 4    9.0
dtype: float64

**String Methods**

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
string_series = pd.Series(["day 0", "day 1", "day 2", "day 3", "day 4"])
string_series

0    day 0
1    day 1
2    day 2
3    day 3
4    day 4
dtype: object

In [ ]:
string_series.str.contains("1")

0    False
1     True
2    False
3    False
4    False
dtype: bool

In [ ]:
string_series.str.contains("day")

0    True
1    True
2    True
3    True
4    True
dtype: bool

In [ ]:
string_series.str.upper()

0    DAY 0
1    DAY 1
2    DAY 2
3    DAY 3
4    DAY 4
dtype: object

In [ ]:
string_series.str.upper().str.contains("DAY 1")

0    False
1     True
2    False
3    False
4    False
dtype: bool

In [ ]:
string_series.str.strip('day').astype('int')

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [ ]:
string_series.str[-1]

0    0
1    1
2    2
3    3
4    4
dtype: object

In [ ]:
string_series.str.split('', expand = True)

  0  1  2  3  4  5 6
0    d  a  y     0
1    d  a  y     1
2    d  a  y     2
3    d  a  y     3
4    d  a  y     4

**Numeric Series Aggregation**

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [ ]:
transactions = pd.read_csv("/content/drive/MyDrive/Colab Notebooks/transactions.csv")
transactions_series = pd.Series(transactions["transactions"])
transactions_series.iloc[:5]

0     770
1    2111
2    2358
3    3487
4    1922
Name: transactions, dtype: int64

In [ ]:
transactions_series.count()
#The number of rows in the transactions column that are NOT empty (not NaN).

np.int64(83488)

In [ ]:
transactions_series.sum()

np.int64(141478945)

In [ ]:
transactions_series.mean()

np.float64(1694.6021583940208)

In [ ]:
transactions_series.quantile([.5])

0.5    1393.0
Name: transactions, dtype: float64

In [ ]:
transactions_series.quantile([.5], interpolation = "nearest")

0.5    1393
Name: transactions, dtype: int64

**Categorical Series Aggregation**

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
string_series = pd.Series(["day 2", "day 2", "day 3", "day 3", "day 4"])
string_series

0    day 2
1    day 2
2    day 3
3    day 3
4    day 4
dtype: object

In [ ]:
string_series.nunique()

3

In [ ]:
string_series.unique()

array(['day 2', 'day 3', 'day 4'], dtype=object)

In [ ]:
string_series.value_counts()

day 2    2
day 3    2
day 4    1
Name: count, dtype: int64

In [ ]:
string_series.value_counts(normalize = True)

day 2    0.4
day 3    0.4
day 4    0.2
Name: proportion, dtype: float64

**Identifying Missing Data**

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
my_service = pd.Series([np.nan] * 5)
my_service

0   NaN
1   NaN
2   NaN
3   NaN
4   NaN
dtype: float64

In [ ]:
my_service.isna().mean()

np.float64(1.0)

In [ ]:
my_service.astype

<bound method NDFrame.astype of 0   NaN
1   NaN
2   NaN
3   NaN
4   NaN
dtype: float64>

In [ ]:
my_service = pd.Series([np.nan] * 5)
my_service = my_service.astype("Int64")
my_service

0    <NA>
1    <NA>
2    <NA>
3    <NA>
4    <NA>
dtype: Int64

In [ ]:
my_service = pd.Series(range(5))
my_service.loc[1:2] = pd.NA
my_service

0    0.0
1    NaN
2    NaN
3    3.0
4    4.0
dtype: float64

In [ ]:
my_service.isna()

0    False
1     True
2     True
3    False
4    False
dtype: bool

In [ ]:
my_service.value_counts(dropna = False)

NaN    2
0.0    1
3.0    1
4.0    1
Name: count, dtype: int64

In [ ]:
my_service.fillna(0)

0    0.0
1    0.0
2    0.0
3    3.0
4    4.0
dtype: float64

In [ ]:
my_service.dropna()

0    0.0
3    3.0
4    4.0
dtype: float64

In [ ]:
my_service.dropna().reset_index(drop = True)

0    0.0
1    3.0
2    4.0
dtype: float64

**The Apply Method**

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
string_series = pd.Series(['day 0', 'day 0', 'day 2', 'day 2', 'day 4'])
string_series

0    day 0
1    day 0
2    day 2
3    day 2
4    day 4
dtype: object

In [ ]:
string_series.apply(lambda x:x[-1])

0    0
1    0
2    2
3    2
4    4
dtype: object

In [ ]:
string_series.str[-1]

0    0
1    0
2    2
3    2
4    4
dtype: object

In [ ]:
def search(string, looking_for):
  if looking_for is string:
      return "Found It!"
  return "Nope!"

In [ ]:
a = string_series.str[-1]
a.apply(search, args = '2')

0         Nope
1         Nope
2    Found It!
3    Found It!
4         Nope
dtype: object

**The Where Method**

cont

In [ ]:
string_series.where(string_series.str.contains('2', 'Nope!'))

0      NaN
1      NaN
2    day 2
3    day 2
4      NaN
dtype: object